ПосуточнаяАрендаКвартир/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
</mdclass:Catalog>

ПосуточнаяАрендаКвартир/src/Enums/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Должности</name>
  <enumValues>
    <name>Администратор</name>
  </enumValues>
  <enumValues>
    <name>МенеджерПоАренде</name>
  </enumValues>
</mdclass:Enum>

ПосуточнаяАрендаКвартир/src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ТекущийОбъект.ИдентификаторПользователяИБ);
	
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем реквизиты формы
	Логин = ПользовательИБ.Имя;
	ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
	
	Если ПользовательИБ.ПарольУстановлен Тогда
		Пароль = Новый УникальныйИдентификатор; // маскируем текущий пароль
	Иначе
		Пароль = "";
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	    // Если вход разрешён – логин обязателен
    Если ВходРазрешен И НЕ ЗначениеЗаполнено(Логин) Тогда
        Сообщить("Не заполнен логин пользователя. Заполнение обязательно при разрешённом входе.");
        Отказ = Истина;
        Возврат;
    КонецЕсли;
	
	// Ищем/создаём пользователя ИБ
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ТекущийОбъект.ИдентификаторПользователяИБ);
		
		Если ПользовательИБ = Неопределено Тогда
			ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		КонецЕсли;
		
	Иначе
		
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
		
	КонецЕсли;
	
	// Если пользователь новый и вход запрещён – ничего не делаем
	Если Не ЗначениеЗаполнено(ПользовательИБ.УникальныйИдентификатор)
		И Не ВходРазрешен Тогда
		Возврат;
	КонецЕсли;
	
	// Общие свойства пользователя
	ПользовательИБ.ПолноеИмя = Объект.Наименование;
	ПользовательИБ.Имя = Логин;
	ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
	
	Если ЗначениеЗаполнено(Пароль) Тогда
	    ПользовательИБ.Пароль = Пароль;
	КонецЕсли;
	
	// Назначаем роли
	ПользовательИБ.Роли.Очистить();
	
	// Администратор – полные права
	Если ТекущийОбъект.Должность = Перечисления.Должности.Администратор Тогда
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
		
	// Менеджер по аренде – ограниченные права
	ИначеЕсли ТекущийОбъект.Должность = Перечисления.Должности.МенеджерПоАренде Тогда
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЧтениеНСИ);
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеНСИ);
		
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЧтениеДокументовБронирования);
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеДокументовБронирования);
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ЧтениеДокументовПродажи);
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ДобавлениеИзменениеДокументовПродажи);
		
	КонецЕсли;
	
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

#КонецОбласти
